package algorithms

// /*
// Фреймворк A - XX.X%

// Время: O(…)
// Память: O(…)

// Пример:
// Вход:
// Выход:

// Флаги:
// 1.
// 2.
// */
// func a(...) ... {
// 	// 1.
// 	// 2.
// 	// 3.
// 	// 4.
// 	// 5.
// 	return ...
// }

// /*
// Фреймворк B - XX.X%

// Время: O(…)
// Память: O(…)

// Пример:
// Вход:
// Выход:

// Флаги:
// 1.
// 2.
// */
// func b(...) ... {
// 	// 1.
// 	// 2.
// 	// 3.
// 	// 4.
// 	// 5.
// 	return ...
// }

// /*
// Фреймворк C - XX.X%

// Время: O(…)
// Память: O(…)

// Пример:
// Вход:
// Выход:

// Флаги:
// 1.
// 2.
// */
// func c(...) ... {
// 	// 1.
// 	// 2.
// 	// 3.
// 	// 4.
// 	// 5.
// 	return ...
// }
